//========================================================================================================================
// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
//========================================================================================================================
Console.Clear();
Console.WriteLine("Input number:");
int N = Convert.ToInt32(Console.ReadLine());

for (int i = 0; i <= N; i=i+2)
{
    if (i > 0) //Ноль не включен в диапазон вывода, но нужен для инкремента = 2
    {
        Console.Write(i);
        if (i < N) //Не выводим разделитель после последнего числа
            Console.Write(" "); 
    }   
}     